spec/vcr/one_time_payment.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=client%40example.com
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer sk_test_sh18MsBrCNXjfaeymmbRMVLH
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        192-168-0-103.rdsnet.ro 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21
        PST 2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"192-168-0-103.rdsnet.ro"}'
      Content-Length:
      - '26'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sun, 26 Mar 2017 22:38:09 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '636'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AMSvYZsJ7G3X12
      Stripe-Version:
      - '2016-07-06'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AMSvOunTmAHmkF",
          "object": "customer",
          "account_balance": 0,
          "created": 1490567889,
          "currency": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "client@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AMSvOunTmAHmkF/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AMSvOunTmAHmkF/subscriptions"
          }
        }
    http_version: 
  recorded_at: Sun, 26 Mar 2017 22:38:09 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=6000&currency=usd&customer=cus_AMSvOunTmAHmkF&description=
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer sk_test_sh18MsBrCNXjfaeymmbRMVLH
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.3.1 p112 (2016-04-26)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        192-168-0-103.rdsnet.ro 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21
        PST 2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"192-168-0-103.rdsnet.ro"}'
      Content-Length:
      - '65'
      Host:
      - api.stripe.com
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Sun, 26 Mar 2017 22:38:10 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '157'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AMSvWuL8KwNzCs
      Stripe-Version:
      - '2016-07-06'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Cannot charge a customer that has no active card",
            "type": "card_error",
            "param": "card",
            "code": "missing"
          }
        }
    http_version: 
  recorded_at: Sun, 26 Mar 2017 22:38:10 GMT
recorded_with: VCR 3.0.3
